GA_HeatTransfer/Control_Test/Min/CFD/0/thickness
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thickness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            symmetryPlane;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    Surface1
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
368
(
0.000560851
0.000563223
0.000563051
0.000563174
0.000560893
0.000563182
0.000563218
0.000563225
...
)
;
    }
    Surface2
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
368
(
0.000563225
0.000563225
0.000563223
0.000563051
0.000563051
0.000563207
0.000563238
0.000563242
...
)
;
    }
    Surface3
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
368
(
0.000560851
0.000563223
0.000563051
0.000563174
0.000560893
0.000563182
0.000563218
0.000563225
...
)
;
    }
    Surface4
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
736
(
0.000560852
0.000563223
0.000563225
0.000563225
0.000563051
0.000563051
0.000563051
0.000563223
...
)
;
    }
}


// ************************************************************************* //
